// MaharajahPlaces.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// 
// Найти количество расстановок K фигур магарадж на доске N x N так, что бы они не били друг друга
// прим.: магараджа сочетает в себе свойства ферзя и коня.

#include <iostream>

int main()
{
    std::cout << "Hello World!\n"; 
}
